# encoding: utf-8
# language: ru

@Smoke @ДымовойТест
Функционал: Дымовой тест Vanessa Automation
	Как администратор
	Я хочу открыть простую форму и проверить её заголовок
	Чтобы убедиться, что связка Vanessa Automation и клиента тестирования работает на этой базе

	Контекст:
		Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
		И я закрыл все окна клиентского приложения

	@Smoke
	Сценарий: Открытие списка номенклатуры
		Дано Я открываю навигационную ссылку "e1cib/list/Справочник.Номенклатура"
		Тогда открылось окно "Номенклатура*"
